/*******************************************************************/
/* Имя: CreateTempFile.js                                          */
/* Язык: JScript                                                   */
/* Описание: Создание временного файла со случайным именем         */
/*******************************************************************/
var 
  FSO,FileName,F,s;  //Объявляем переменные
//Создаем объект FileSystemObject
FSO=WScript.CreateObject("Scripting.FileSystemObject");
//Генерируем случайное имя файла
FileName=FSO.GetTempName();
//Создаем файл и именем FileName
F=FSO.CreateTextFile(FileName, true); 
//Закрываем файл
F.Close();
//Сообщаем о создании файла
WScript.Echo("Был создан файл",FileName);
/*************  Конец *********************************************/
