/*******************************************************************/
/* Имя: FileInfo.js                                                */
/* Язык: JScript                                                   */
/* Описание: Вывод на экран некоторых свойств файла                */
/*******************************************************************/
var FSO,F,s;   //Объявляем переменные

//Создаем объект FileSystemObject
FSO = WScript.CreateObject("Scripting.FileSystemObject");
//Создаем объект File
F=FSO.GetFile("C:\\boot.ini");

//Получаем имя файла
s="Файл: "+F.Name+"\n";
//Получаем дату создания файла
s+="Дата создания: "+F.DateCreated+"\n";
//Получаем тип файла
s+="Тип: "+F.Type+"\n";
//Выводим информацию на экран
WScript.Echo(s);
/*************  Конец *********************************************/
