/*******************************************************************/
/* Имя: IsExistsFile.js                                            */
/* Язык: JScript                                                   */
/* Описание: Проверка существования файла                          */
/*******************************************************************/
var FSO,FileName;   //Объявляем переменные

//Создаем объект FileSystemObject
FSO = WScript.CreateObject("Scripting.FileSystemObject");

FileName="C:\\boot.ini";
if (FSO.FileExists(FileName))
  //Выводим информацию на экран
  WScript.Echo("Файл "+FileName+" существует");
else
  //Выводим информацию на экран
  WScript.Echo("Файл "+FileName+" не существует");
/*************  Конец *********************************************/
