/*******************************************************************/
/* Имя: RunConApp.js                                               */
/* Язык: JScript                                                   */
/* Описание: Запуск независимого консольного приложения и          */
/*           определение его кода выхода                           */
/*******************************************************************/
var WshShell, Code;  //Объявляем переменные
//Создаем объект WshShell
WshShell = WScript.CreateObject("WScript.Shell");
//Запускаем утилиту xcopy с ключом "/?" и ожидаем окончания ее работы
Code=WshShell.Run("xcopy /?",1,true);
//Печатаем полученный код возврата
WScript.Echo("Код возврата: ", Code);
/*************  Конец *********************************************/
