/******************************************************************/
/* Имя: SpecFold1.js                                              */
/* Язык: JScript                                                  */
/* Описание: Вывод названий всех специальных папок Windows        */
/******************************************************************/
var WshShell, WshFldrs, i, s;  //Объявляем переменные
//Создаем объект WshShell
WshShell = WScript.CreateObject("Wscript.Shell");
//Создаем объект WshSpecialFolders
WshFldrs = WshShell.SpecialFolders;
s="Список всех специальных папок:\n\n";
//Перебираем все элементы коллекции WshFldrs
for (i=0;i<= WshFldrs.Count()-1;i++){
  //Формируем строки с путями к специальным папкам
  s+=WshFldrs(i)+"\n";
  }
WScript.Echo(s);
/*************  Конец *********************************************/
