/*******************************************************************/
/* Имя: StdOu2.js                                                  */
/* Язык: JScript                                                   */
/* Описание: Вывод сразу нескольких строк (StdOut.WriteLine)       */
/*******************************************************************/
var s;  //Объявляем переменную
s="Пример\nвывода\nнескольких\nстрок"; //Формируем строки
WScript.StdOut.WriteLine(s);  //Выводим строки
/*************  Конец *********************************************/
