/*******************************************************************/
/* Имя: StdOut3.js                                                 */
/* Язык: JScript                                                   */
/* Описание: Пример использования метода StdOut.WriteLine          */
/*******************************************************************/
var n,StdOut;  //Объявляем переменные
n=1+2;
StdOut=WScript.StdOut;  //Сохраняем ссылку на StdOut в переменной
//Выводим строки в StdOut
StdOut.WriteLine("Пример использования метода StdOut.WriteLine() ...");
StdOut.WriteLine("1+2="+n);
/*************  Конец *********************************************/
