'*******************************************************************
' Имя: StdOut1.vbs
' Язык: VBScript
' Описание: Пример использования методов StdOut.Write и StdOut.WriteLine
'*******************************************************************
Option Explicit

Dim n   ' Объявляем переменную
n=1+2
' Печать без перевода строки
WScript.StdOut.Write "Использование метода "
' Выводим строку с текущей позиции курсора
WScript.StdOut.WriteLine "StdOut.WriteLine"
' Печатаем строку и значение переменной
WScript.StdOut.WriteLine "Например, 1+2=" & n
'*************  Конец *********************************************
