'*******************************************************************
' Имя: StdOut3.vbs
' Язык: JScript
' Описание: Пример использования метода StdOut.WriteLine
'*******************************************************************
Option Explicit

Dim n,StdOut  ' Объявляем переменные
n=1+2
Set StdOut=WScript.StdOut  ' Сохраняем ссылку на StdOut в переменной
' Выводим строки в StdOut
StdOut.WriteLine "Это пример использования метода StdOut.WriteLine() ..."
StdOut.WriteLine "1+2=" & n
'*************  Конец *********************************************
